cask_args appdir: "/Applications"

tap "homebrew/cask"

cask "google-chrome"
cask "iterm2"
cask "spotify"
cask "visual-studio-code"
cask "alfred"
cask "caffeine"
cask "docker"
cask "flux"
cask "gitkraken"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "paste"
cask "pdf-expert"

cask "bittorrent"




brew "yqrashawn/goku/goku"
brew "jq"
