cask_args appdir: "/Applications"
tap "homebrew/cask"
tap "homebrew/cask-versions"

# if these are on nix, move them.
brew "mas"
brew "dog"
brew "git-delta" # on nix but seems outdated

cask "alfred"
cask "caffeine"
cask "dash"
cask "db-browser-for-sqlite"
cask "dropbox"
cask "firefox-developer-edition"
cask "gitkraken"
cask "google-chrome"
cask "google-cloud-sdk"
cask "graphiql"
cask "graphql-playground"
cask "iterm2"
cask "karabiner-elements"
cask "kitty"
cask "macdown"
cask "macvim"
cask "notion"
cask "paste"
cask "pdf-expert"
cask "phoenix"
cask "postman"
cask "sequel-pro"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "telegram"
cask "visual-studio-code"
